Repository: alexclassroom/two-factor-provider-webauthn
Catalog: lang/2fa-*.po
Languages: wa_js_ru_ru

source: This key is already registered.
wa_js_ru_ru: Этот ключ уже зарегистрирован.

source: Fetching registration information…
wa_js_ru_ru: Получаем регистрационную информацию…

source: Generating credentials…
wa_js_ru_ru: Создание учётных данных…

source: Registering credentials…
wa_js_ru_ru: Регистрация учётных данных…

source: Unable to create public key credentials
wa_js_ru_ru: Не удалось создать учетные данные открытого ключа

source: The key has been registered.
wa_js_ru_ru: Ключ зарегистрирован.

source: Sending request…
wa_js_ru_ru: Отправка запроса…

source: The key has been revoked.
wa_js_ru_ru: Ключ отозван.

source: WebAuthn is not supported by the browser.
wa_js_ru_ru: Данный бразуер не поддерживает WebAuthn.

source: Unable to get a public key credential.
wa_js_ru_ru: Не удалось получить учётные данные открытого ключа.

source: The request is not allowed.
wa_js_ru_ru: Запрос запрещён.

source: The operation is insecure.
wa_js_ru_ru: Данная операция является небезопасной.

source: The operation is not supported.
wa_js_ru_ru: Данная операция не поддерживается.

source: The operation was canceled.
wa_js_ru_ru: Операция была отменена.

source: You cannot use this key to log in.
wa_js_ru_ru: Нельзя использовать данный ключ для входа.
