Repository: alexclassroom/two-factor-provider-webauthn
Catalog: lang/two-factor-provider-webauthn-*.po
Languages: ru_ru, uk

source: WebAuthn Provider for Two Factor plugin.
ru_ru: WebAuthn Provider для плагина Two Factor.
uk: WebAuthn Provider для плагіна Two Factor.

source: Volodymyr Kolesnykov
ru_ru: Владимир Колесников
uk: Володимир Колесников

source: TwoFactor WebAuthn Settings
ru_ru: Настройки TwoFactor WebAuthn
uk: Налаштування TwoFactor WebAuthn

source: Authenticator Attachment Modality
uk: Модальність прикріплення аутентифікатора

# Authenticator attachment modality
source: None
ru_ru: Нет
uk: Немає

# Authenticator attachment modality
source: Cross-platform
ru_ru: Кросс-платформенная
uk: Кросплатформна

# Authenticator attachment modality
source: Platform
ru_ru: Платформозависимая
uk: Залежна від платформи

source: <em>Platform attachment</em> is for authenticators physically bound to a client device (like a fingerprint scanner on a smartphone).<br/><em>Cross-platform attachment</em> is for removable authenticators which can "roam" between client devices (like a security key).<br/>Consider using <em>None</em> if you do not need to restrict your users to the specific class of authenticators.<br/><a href="https://www.w3.org/TR/webauthn-2/#authenticator-attachment-modality">Details</a>
uk: <em>Залежна від платформи прикріплення</em> призначено для аутентифікаторів, які фізично прив'язані до пристрою клієнта (наприклад, сканер відбитків пальців на смартфоні).<br/><em>Кросплатформне прикріплення</em> призначено для знімних аутентифікаторів, які можуть переміщатися між пристроями клієнта (наприклад, ключ безпеки).<br/>Виберіть <em>Немає</em>, якщо вам не потрібно обмежувати ваших користувачів до певного класу аутентифікаторів.<br/><a href="https://www.w3.org/TR/webauthn-2/#authenticator-attachment-modality">Деталі</a>

source: User Verification Requirement
ru_ru: Требование проверки пользователя
uk: Вимога перевірки користувача

# User Verification Requirement
source: Discouraged
ru_ru: Не проверять
uk: Не рекомендується

# User Verification Requirement
source: Preferred
ru_ru: По возможности
uk: Бажано

# User Verification Requirement
source: Required
ru_ru: Обязательно проверять
uk: Обов'язково

source: <em>Discouraged</em>: user verification is not required (e.g., in the interest of minimizing disruption to the user interaction flow).<br/><em>Preferred</em>: user verification (like entering a PIN code) is preferred but not required for successful authentication.<br/><em>Required</em>: user verification is required for successful authentication. Please note that not all browsers support this setting.<br/>
uk: <em>Не рекомендується</em>: перевірка користувача не потрібна (наприклад, в інтересах мінімізації порушення потоку взаємодії з користувачем).<br/><em>Бажано</em>: перевірка користувача (наприклад, введення PIN-коду) бажана, але не обов'язкова для успішної аутентифікації.<br/><em>Обов'язково</em>: для успішної аутентифікації потрібна перевірка користувача. Зверніть увагу, що не всі браузери підтримують цей параметр.<br/>

source: Timeout
ru_ru: Таймаут
uk: Тайм-аут

source: The default timeout for security key operations, in seconds. Set to 0 to use the browser default value.
ru_ru: Значение таймаута для операций с ключами безопасности по умолчанию (в секундах). Установите в 0 для использования значения браузера по умолчанию.
uk: Тайм-аут за замовчуванням для операцій з ключем безпеки, в секундах. Встановіть 0, щоб використовувати значення за замовчуванням браузера.

source: U2F compatibility hack
ru_ru: Хак для совместивости с U2F
uk: Хак сумісності з U2F

source: Chrome for Android sometimes ignores the AppID extension required for interoperability between the old U2F and the modern WebAuthn protocol.<br/>When enabled, this hack enables the check whether the security key used was registered with U2F and if so, forces the use of the AppID extension.
ru_ru: Chrome для Android иногда игнорирует расширение AppID, необходимое для функциональной соместимости между старым протоколом U2F и новым протоколом WebAuthn.<br/>Разрешение данного хака включает проверку, был ли ключ зарегистрирован при помощи U2F; если да, то поддержка AppID включается принудительно.
uk: Chrome для Android іноді ігнорує розширення AppID, необхідне для взаємодії між старим U2F та сучасним протоколом WebAuthn.<br/>Якщо ввімкнено, цей хак дозволяє перевірити, чи був використаний ключ безпеки, зареєстрований з U2F, і якщо так, то змушує використовувати розширення AppID.

source: Disable old U2F provider
uk: Вимкнути старий постачальник U2F

source: This option allows you to turn off the old U2F provider in the Two Factor plugin.
uk: Ця опція дозволяє вимкнути старий постачальник U2F в плагіні Two Factor.

source: The nonce has expired. Please reload the page and try again.
ru_ru: Срок действия одноразового номера истёк. Пожалуйста, обновите страницу и попытайтесь выполнить действие снова.
uk: Термін дії одноразового номера закінчився. Будь ласка, перезавантажте сторінку та спробуйте ще раз.

source: Unable to retrieve the registration context.
ru_ru: Не удалось получить контекст регистрации.
uk: Не вдалося отримати контекст реєстрації.

source: Bad request.
ru_ru: Неверный запрос.
uk: Неправильний запит.

source: New Key
ru_ru: Новый ключ
uk: Новий ключ

source: Unable to save the key to the database.
uk: Не вдалося зберегти ключ в базі даних.

source: Key name cannot be empty.
ru_ru: Имя ключа не может быть пустым.
uk: Ім'я ключа не може бути порожнім.

source: Failed to rename the key.
ru_ru: Не удалось переименовать ключ.
uk: Не вдалося перейменувати ключ.

source: Name
ru_ru: Имя
uk: Ім'я

source: Counter
ru_ru: Счётчик
uk: Лічильник

source: Added
ru_ru: Добавлен
uk: Додано

source: Last Used
ru_ru: Последнее использование
uk: Останнє використання

source: Rename
ru_ru: Переименовать
uk: Перейменувати

source: Revoke
ru_ru: Отозвать
uk: Відкликати

source: WebAuthn requires an HTTPS connection. Please use an alternative second factor method.
ru_ru: Для использования WebAuthn требуется соединение HTTPS. Пожалуйста, воспользуйтесь альтернативным методом двухфакторной аутентификации.
uk: WebAuthn вимагає HTTPS-з'єднання. Будь ласка, використовуйте альтернативний метод другого фактора.

source: Unable to retrieve the authentication context.
ru_ru: Не удалось получить контекст аутентификации.
uk: Не вдалося отримати контекст аутентифікації.

source: Unable to save the user handle to the database.
uk: Не вдалося зберегти ідентифікатор користувача в базі даних.

source: Please insert (and tap) your security key.
ru_ru: Пожалуйста, вставьте и коснитесь ключа безопасности.
uk: Будь ласка, вставте (і натисніть) свій ключ безпеки.

source: Requires an HTTPS connection. Please configure your security keys in the <a href="#webauthn-security-keys-section">Security Keys (WebAuthn)</a> section below.
ru_ru: Требуется безопасное соединение (HTTPS). Для управления ключами воспользуйтесь секцией <a href="#webauthn-security-keys-section">Ключи безопасности (WebAuthn)</a>
uk: Вимагає HTTPS-з'єднання. Будь ласка, налаштуйте свої ключі безпеки в розділі <a href="#webauthn-security-keys-section">Ключі безпеки (WebAuthn)</a> нижче.

source: Security Keys (WebAuthn)
ru_ru: Ключи безопасности (WebAuthn)
uk: Ключі безпеки (WebAuthn)

source: You need to enable JavaScript to manage security keys.
ru_ru: Для управления ключами безопасности необходимо включить JavaScript.
uk: Потрібно ввімкнути JavaScript, щоб керувати ключами безпеки.

source: WebAuthn requires an HTTPS connection. You will be unable to add new security keys over HTTP.
ru_ru: Для WebAuthn требуется соединение HTTPS. Добавление новых ключей по HTTP невозможно.
uk: WebAuthn вимагає HTTPS-з'єднання. Ви не зможете додавати нові ключі безпеки через HTTP.

source: Key name:
ru_ru: Имя ключа:
uk: Ім'я ключа:

# security key
source: Register New Key
ru_ru: Зарегистрировать новый ключ
uk: Зареєструвати новий ключ

source: Are you sure to revoke this key?
ru_ru: Вы уверены, что хотите отозвать данный ключ?
uk: Ви впевнені, що хочете відкликати цей ключ?

source: New name:
ru_ru: Новое имя:
uk: Нове ім'я:
