Repository: alexclassroom/two-factor-provider-webauthn
Catalog: lang/two-factor-provider-webauthn-js-*.po
Languages: uk

source: This key is already registered.
uk: Цій ключ вже зареєстровано.

source: Fetching registration information…
uk: Отримання інформації про реєстрацію…

source: Generating credentials…
uk: Генерація облікових даних…

source: Registering credentials…
uk: Реєстрація облікових даних…

source: Unable to create public key credentials
uk: Не вдалося створити облікові дані публічного ключа

source: The key has been registered.
uk: Ключ було зареєстровано.

source: Sending request…
uk: Надсилання запиту…

source: The key has been revoked.
uk: Ключ було відкликано.

source: The key has been renamed.
uk: Ключ було перейменовано.

source: WebAuthn is not supported by the browser.
uk: WebAuthn не підтримується браузером.

source: Unable to get a public key credential.
uk: Не вдалося отримати облікові дані публічного ключа.

source: The request is not allowed.
uk: Запит не дозволено.

source: The operation is insecure.
uk: Операція небезпечна.

source: The operation is not supported.
uk: Операція не підтримується.

source: The operation was canceled.
uk: Операцію скасовано.

source: You cannot use this key to log in.
uk: Ви не можете використовувати цей ключ для входу.
